In [1]:
%load_ext sql

In [2]:
%sql mysql+pymysql://root:3141592630Pi$@localhost/population

In [3]:
%sql call p_exp_cursor()

 * mysql+pymysql://root:***@localhost/population
1 rows affected.

[('New York', 'New York', 1694251)]

In [4]:
%sql select * from county_population order by population DESC limit 5

 * mysql+pymysql://root:***@localhost/population
5 rows affected.

[('New York', 'New York', 1694251),
 ('New York', 'Suffolk', 1525920),
 ('New York', 'Bronx', 1472654),
 ('New York', 'Nassau', 1395774),
 ('New York', 'Kings-1', 1368037)]

In [5]:
%%sql

DROP PROCEDURE IF EXISTS p_exe_cursor;

CREATE PROCEDURE p_exe_cursor()
BEGIN
  DECLARE v_state VARCHAR(30);
  DECLARE v_county VARCHAR(30);
  DECLARE v_population INT DEFAULT 0;
  DECLARE done BOOL DEFAULT FALSE;

  -- Declare the cursor
  DECLARE county_cursor CURSOR FOR
    SELECT state, county, population
    FROM county_population
    WHERE state = 'New York'
    AND population > 1400000;

  -- Declare the CONTINUE HANDLER for handling the end of the cursor
  DECLARE CONTINUE HANDLER FOR NOT FOUND SET done = TRUE;
    
create temporary table if not exists temp_tbl(state varchar(30),county varchar(30),population int);

  -- Open the cursor
  OPEN county_cursor;

  -- Start the loop to fetch rows
  read_loop: LOOP
    FETCH county_cursor INTO v_state, v_county, v_population;

    -- Exit loop if no more rows to fetch
    IF done THEN
      LEAVE read_loop;
    END IF;

    -- Do something with the fetched data (for now just select them)
insert into temp_tbl values(v_state,v_county,v_population);

  END LOOP read_loop;

  -- Close the cursor
  CLOSE county_cursor;

select * from temp_tbl;
END

 * mysql+pymysql://root:***@localhost/population
0 rows affected.
0 rows affected.

[]

In [6]:
%sql call p_exe_cursor();

 * mysql+pymysql://root:***@localhost/population
3 rows affected.

[('New York', 'New York', 1694251),
 ('New York', 'Suffolk', 1525920),
 ('New York', 'Bronx', 1472654)]

In [7]:
%%sql

drop procedure if exists p_split_cursor;

CREATE  PROCEDURE p_split_cursor()
begin 
   declare v_state varchar(100);
   declare v_county varchar(100);
   declare v_population int;
   declare done bool default false;
   
   declare county_cursor cursor for 
      select state,
             county,
             population
     from county_population
     where state = 'New York' and population > 1400000;
     
  declare continue handler for  not found set done = true;
  
  open county_cursor;
  
  fetch_loop: loop
    fetch county_cursor into v_state,v_county,v_population;
 if done then
   leave fetch_loop;
end if;

set @cnt=1;
split_loop: loop
insert into county_population (state,county,population)
values (v_state,concat(v_county,'-',@cnt),round(v_population/2));
set @cnt = @cnt +1;
if @cnt >2 then
  leave split_loop;
end if;
end loop split_loop;

delete from county_population where county = v_county;

end loop fetch_loop;
 
close county_cursor;
end

 * mysql+pymysql://root:***@localhost/population
0 rows affected.
0 rows affected.

[]

In [9]:
%sql select * from county_population limit 5

 * mysql+pymysql://root:***@localhost/population
5 rows affected.

[('New York', 'New York', 1694251),
 ('New York', 'Suffolk', 1525920),
 ('New York', 'Bronx', 1472654),
 ('New York', 'Nassau', 1395774),
 ('New York', 'Westchester', 1004457)]

In [10]:
%sql call p_split_cursor();

 * mysql+pymysql://root:***@localhost/population
0 rows affected.

[]

In [14]:
%sql select distinct * from county_population where county like '%-%';

 * mysql+pymysql://root:***@localhost/population
10 rows affected.

[('New York', 'Kings-1', 1368037),
 ('New York', 'Kings-2', 1368037),
 ('New York', 'Queens-1', 1202732),
 ('New York', 'Queens-2', 1202732),
 ('New York', 'New York-1', 847126),
 ('New York', 'New York-2', 847126),
 ('New York', 'Suffolk-1', 762960),
 ('New York', 'Suffolk-2', 762960),
 ('New York', 'Bronx-1', 736327),
 ('New York', 'Bronx-2', 736327)]